// Тема 11. Об’єкти. Створення, властивості, методи об'єкту
// 41. Створити порожній об'єкт user і додати до нього властивості name та age через крапку.
let user = {};
user.name = "mykola";
user.age = 12;
console.log(user)
// 42. Створити об'єкт car з властивостями через квадратні дужки [], використовуючи змінні як ключі.
let car = {
    mark: "BMW",
    age: 1.1
}
console.log(car["mark"]);

// 43. Спробувати прочитати властивість об'єкта, якої не існує, та повернути дефолтне значення через ||.
let empty = {};
console.log(empty.kokos || ("mykola"));
// 44. Видалити властивість status з об'єкта за допомогою оператора delete.
let item = {
    status: "afk",
    test: "test"
};
delete item.status;
console.log(item);
// 45. Створити функцію-фабрику, яка приймає два параметри й повертає об'єкт, використовуючи короткі властивості (Property shorthand).
function createUser(name, age) {
    return {name, age};
};
console.log(createUser("mykola", 500));
// 46. Створити об'єкт, де назва ключа обчислюється динамічно на основі результату змігної (обчислювані властивості).
let dinamicKey = "mykola";
const user1 = {
    [dinamicKey]:554
};
console.log(user1);

// 47. Перевірити, чи існує в об'єкті product властивість price, за допомогою оператора in.
// 48. Додати до готового об'єкта метод sayHello, який просто виводить вітання в консоль.

let object = {};
object.sayHello = "Hello";
console.log(object);
// 49. Використати ключеве слово this всередині методу об'єкта для виведення його внутрішньої властивості.
let objct = {
    name: mykola,
    age: 5000,
    information:function () {
        console.log(`name: ${this.name}, age: ${this.age}.`)
    }
}
console.log(objct);
// 50. Створити метод, який за допомогою this змінює числову властивість об'єкта (наприклад, збільшує лічильник на 1).
// 51. Створити об'єкт calculator з методами для додавання та віднімання двох чисел, які зберігаються всередині об'єкта.
// 52. Реалізувати перевірку наявності властивості в об'єкті через порівняння з undefined.
// 53. Створити вкладений об'єкт (об'єкт в об'єкті) та отримати доступ до властивості третього рівня вкладеності.
// 54. Створити метод, який приймає аргумент і додає його до масиву, що є властивістю цього ж об'єкта.
// 55. Написати метод об'єкта, який викликає інший метод цього ж об'єкта через this.
// 56. Створити об'єкт stepCounter з методами increment, decrement та reset, які змінюють властивість steps.
// 57. Створити об'єкт, який описує книгу, де один з методів повертає рядок-опис на основі автора та назви через this.
// 58. Динамічно перевизначити (перезаписати) існуючий метод об'єкта новою функцією.
// 59. Створити об'єкт, що містить інформацію про товар, і метод, який розраховує кінцеву вартість з урахуванням знижки, що зберігається в об'єкті.
// 60. Створити два різних об'єкти (два користувачі) та одну зовнішню функцію, яка прив'язується до них як метод і виводить їхні імена через this.