// 21. Переписати стандартну функцію function square(n) { return n * n; } у форматі стрілочної функції.
let square = (n) => n * n;
console.log(square(5));
// 22. Створити стрілочну функцію isPositive(num), яка в один рядок перевіряє, чи число більше за 0.
let isPositive = (num) => num > 0;
console.log(isPositive(2));
// 23. Написати стрілочну функцію getMessage(name, role), яка повертає шаблонний рядок через зворотні лапки.
// 24. Створити функцію processNum(num, callback), яка передає цей num у колбек-функцію.
// 25. Написати функцію modifyString(str, callback), яка модифікує рядок за допомогою колбеку (наприклад, робить його uppercase).
// 26. Написати стрілочну функцію без аргументів, яка повертає випадкове число від 1 до 10.
// 27. Створити функцію runner(callback), яка викликає переданий колбек рівно через 2 секунди (використовуючи setTimeout).
// 28. Передати анонімну стрілочну функцію як колбек у метод масиву forEach для виведення елементів.
// 29. Написати функцію calculate(a, b, operation), де operation — це колбек, що виконує додавання або множення.
// 30. Створити стрілочну функцію isEmpty(arr), яка перевіряє довжину масиву в один рядок.
// 31. Написати функцію filterArray(arr, testCallback), яка створює новий масиви лише з елементами, що пройшли перевірку колбеком.
// 32. Перетворити функцію з декількома рядками коду у стрілочну, використовуючи фігурні дужки {} та явний return.
// 33. Створити функцію ask(question, yesCallback, noCallback), яка залежно від булевого значення викликає один з колбеків.
// 34. Написати стрілочну функцію doublePrice(price), яка множить ціну на 2 (implicit return).
// 35. Використати стрілочну функцію всередині setInterval, щоб кожну секунду збільшувати лічильник.
// 36. Написати функцію logger(mode), яка повертає іншу стрілочну функцію для логування залежно від режиму.
// 37. Створити стрілочну функцію, яка приймає об'єкт і повертає значення однієї з його властивостей.
// 38. Написати функцію executeWithLog(fn, arg), яка викликає колбек fn з аргументом arg, але перед цим пише в консоль "Виклик функції".
// 39. Створити стрілочну функцію getTax(amount), яка вираховує 5% податку від суми.
// 40. Написати функцію customMap(arr, callback), яка імітує поведінку map(), змінюючи кожен елемент масиву через колбек.