// ТЕМА 7. МАСИВИ. ІТЕРАЦІЯ

// 5.  Вивести всі елементи масиву.
let array = [1, 2, 3, 4, 5];
for (const numbers of array) {
    console.log(numbers);
}
// 6.  Знайти найбільший елемент.
const numbers = [10, 5, 85, 22, 14];
const max = Math.max(...numbers);

console.log(max);
// 7.  Знайти найменший елемент.
const numbers2 = [10, 5, 85, 22, 14];
const min = Math.min(...numbers2);

console.log(min);
// 8.  Обчислити суму всіх елементів.
// 9.  Обчислити середнє значення.
// 10. Знайти кількість парних чисел.
let numbers3 = [1, 2, 3, 4, 5];
let oddNumbers = 0;
for (number of numbers3) {
   if (number % 2 === 0) {
     oddNumbers++
   }
}
console.log(oddNumbers);
// 11. Вивести всі непарні числа.
// 12. Створити масив з назвами міст.
// 13. Знайти потрібне місто в масиві.
// 14. Вивести елементи у зворотному порядку.
// 15. Створити масив оцінок.
// 16. Порахувати кількість оцінок вище 10.
// 17. Створити масив імен.
// 18. Знайти найдовше ім’я.
// 19. Порахувати загальну довжину всіх слів.
// 20. Створити копію масиву.